<?php
/**
 *
 * @package Recent Topics Extension
 * Ukrainian translation by Alex Diamantopulo
 *
 * @copyright (c) 2015 PayBas
 * @license GNU General Public License, version 2 (GPL-2.0)
 *
 * Based on the original NV Recent Topics by Joas Schilling (nickvergessen)
 *
 */

if (!defined('IN_PHPBB'))
{
	exit;
}
if (empty($lang) || !is_array($lang))
{
	$lang = array();
}

$lang = array_merge($lang, array(
	'RECENT_TOPICS'					=> 'Останні теми',
	'RECENT_TOPICS_EXPLAIN'			=> 'На цій сторінці Ви можете змінити налаштування, специфічні для розширення "Останні Теми". <br /> <br /> Форуми можуть бути включені або виключені шляхом редагування відповідних форумів в АП. <br /> Крім того, обов\'язково перевірте права користувачів, які дають можливість користувачам змінювати наступні налаштування персонально.',
	'RECENT_TOPICS_LIST'			=> 'Відображати в "Останні теми"',
	'RECENT_TOPICS_LIST_EXPLAIN'	=> 'Якщо увімкнено, то теми цього форуму будуть відображатися в списку останнійх тем.',
	'RT_CONFIG'						=> 'Налаштування',
	'RT_ALT_LOCATION'				=> 'Відображати в додаткових розташуваннях',
	'RT_ALT_LOCATION_EXP'			=> 'Використовувати додаткові розташування для відображення розширення "Останні теми"<br />Не всі стилі підтримують це, для стилю prosilver розширення буде переміщено в кінець сторінки.',
	'RT_ANTI_TOPICS'				=> 'Виключені теми',
	'RT_ANTI_TOPICS_EXP'			=> 'Список розділених комами ідентифікаторів тем, котрі не повинні відображатись в списку останніх тем (наприклад: 7, 9)<br />Вкажіть 0 для відключення даної функції.',
	'RT_MIN_TOPIC_LEVEL'			=> 'Мінімальний статус теми',
	'RT_MIN_TOPIC_LEVEL_EXP'		=> 'Мінімальний статус теми для відображення. В списку останніх тем будуть відображені теми з вказаним статусом і вище.<br />(0 = звичайна тема, 1 = прикріплена, 2 = оголошення, 3 = важливе оголошення)',
	'RT_NUMBER'						=> 'Кількість тем в списку',
	'RT_NUMBER_EXP'					=> 'Кількість тем на головній сторінці',
	'RT_PAGE_NUMBER'				=> 'Кількість сторінок в списку тем',
	'RT_PAGE_NUMBER_EXP'			=> 'Можна відображати більшу кількість останніх тем розбиваючи список на сторінки. Просто вкажіть 1 для відключення даної функції. Якщо встановлено значення 0, список буде складатися зі стількох сторінок, скільки необхідно для відображення всіх тем на форумі (не рекомендується).',
	'RT_PARENTS'					=> 'Відображати батьківські форуми',
	'RT_PARENTS_EXP'				=> 'Увімкніть для відображення батьківськіх форумів в списку останніх тем',
	'RT_SORT_START_TIME'			=> 'Сортувати по даті створення  тем',
	'RT_SORT_START_TIME_EXP'		=> 'Увімкніть для сортування тем у списку по даті створення, а не по даті написання останнього повідомлення',
	'RT_UNREAD_ONLY'				=> 'Тільки непрочитані',
	'RT_UNREAD_ONLY_EXP'			=> 'Увімкніть для відображення тільки непрочитаних тем в списку останніх тем, незалежно від того чи є вони "останніми". При цьому працюватимуть ті ж налаштування ("Виключені теми", "форуми" і т.д.), що і в звичайному режимі. Майте на увазі що дана опція впливає лише на зареєстрованих користувачів. Для гостей відображатиметься звичайний список останніх тем',
	'RT_VIEW_ON'					=> 'Відображати список останніх тем на:',
));
